---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PointFailures.HostMeasurementError
source: html/003495bb-a494-64d5-650f-9d216266c255.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PointFailures.HostMeasurementError Property

Invalid host curve measurement type or value or justification

## Syntax (C#)
```csharp
public static FailureDefinitionId HostMeasurementError { get; }
```